[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=8
subdivisions=4
width=1280
height=960
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00000025
burn_in=100

max_batches = 262500
policy=steps
steps=25000,50000,100000
scales=.5,.5,.5
gaussian_noise=1
flip=1



# 0
[convolutional]
dont_update=99999999
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=relu

# 1
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 8
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu


[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 16
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 24
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 32
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=relu


##################################

### ASPPCSP ###
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

### ASPP ###
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=3
activation=relu

[route]
layers=-4

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=5
activation=relu

[route]
layers=-1,-3,-5,-6
### End SPP ###

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -10,-1

# 44
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu
### End SPPCSP ###

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 30

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7


# 56
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 20

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 68
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

##########################

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=relu

[route]
layers = -1,67

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 77
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=relu

[route]
layers = -1,53

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#############################

# ============ End of Neck ============ #

# ============ Head ============ #


# P3
[route]
layers = 80

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=relu

[convolutional]
dont_update=99999999
#sparse=1
size=1
stride=1
pad=1
filters=45
#activation=linear
activation=logistic


[route]
layers = -1
stopbackward=1


# P4
[route]
layers = 91

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=relu

[convolutional]
dont_update=99999999
#sparse=1
size=1
stride=1
pad=1
filters=45
#activation=linear
activation=logistic

[route]
layers = -1
stopbackward=1


# P5
[route]
layers = 102

[convolutional]
dont_update=99999999
sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=relu

[convolutional]
dont_update=99999999
#sparse=1
size=1
stride=1
pad=1
filters=45
#activation=linear
activation=logistic

[route]
layers = -1
stopbackward=1

[route]
layers = 102,53

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=1

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=3

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#80x60

[route]
layers = -1,91,30

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=1

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=3

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#160x120

[route]
layers = -1,80,20

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=1

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu
dilation=3

[route]
layers = -1,-3,-5,-7

# 86
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#320x240

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[upsample]
stride=2
#640x480

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=9
activation=linear

[softmax]
groups=307200
stride=307200
#BGR
num=9
counters_per_class=16,8,1,2,1,1,1,4,1
#counters_per_class=8,8,1,2,1,1,1,4,1
#counters_per_class=4,1,1,1,1,1,1,1,1
#counters_per_class=8,4,2,2,2,1,2,2,2
#colormap=0,0,0, 219,94,86, 86,111,219, 145,219,86, 86,219,127, 86,211,219, 219,194,86, 160,86,219, 219,86,178
colormap=0,0,0, 86,94,219, 219,111,86, 86,219,145, 127,219,86, 219,211,86, 86,194,219, 219,86,160, 178,86,219

