[net]
batch=64
subdivisions=4
width=640
height=640
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=500
max_batches = 70000
policy=steps

steps=12000,24000,35000,50000
scales=.5,.5,.5,.5
gaussian_noise=1
flip=1

##sparse=1 : 2:4 structured sparsity

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu


[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=relu


##################################

### ASPPCSP ###
[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -2

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

### ASPP ###
[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=3
activation=relu

[route]
layers=-4

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=5
activation=relu

[route]
layers=-1,-3,-5,-6
### End ASPP ###

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -10,-1

# 44
[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu
### End ASPPCSP ###

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 30

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7


# 56
[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 20

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu


[convolutional]
#sparse=1
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=relu

[route]
layers = -1,67

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=relu

[route]
layers = -1,53

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
#sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

[convolutional]
#sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#############################

# ============ End of Neck ============ #

# ============ Head ============ #


# P3
[route]
layers = 80

[convolutional]
#sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=relu

[convolutional]
##sparse=1
size=1
stride=1
pad=1
filters=21
#activation=linear
activation=logistic

[yolo]
mask = 0,1,2
anchors =   5, 10,  13, 29,  23, 62,  32,139,  52, 92,  54,232,  94,270, 109,436, 225,477
classes=2
num=9
jitter=.3
scale_x_y = 2.0
ignore_thresh = .5
truth_thresh = 1
#random=1
resize=1.5
new_coords=1
iou_normalizer=0.05
# iou_loss=ciou

# P4
[route]
layers = 91

[convolutional]
#sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=relu

[convolutional]
##sparse=1
size=1
stride=1
pad=1
filters=21
#activation=linear
activation=logistic

[yolo]
mask = 3,4,5
anchors =   5, 10,  13, 29,  23, 62,  32,139,  52, 92,  54,232,  94,270, 109,436, 225,477
classes=2
num=9
jitter=.3
scale_x_y = 2.0
ignore_thresh = .5
truth_thresh = 1
resize=1.5
new_coords=1
iou_normalizer=0.05
# iou_loss=ciou


# P5
[route]
layers = 102

[convolutional]
#sparse=1
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=relu

[convolutional]
##sparse=1
size=1
stride=1
pad=1
filters=21
#activation=linear
activation=logistic

[yolo]
mask = 6,7,8
anchors =   5, 10,  13, 29,  23, 62,  32,139,  52, 92,  54,232,  94,270, 109,436, 225,477
classes=2
num=9
jitter=.3
scale_x_y = 2.0
ignore_thresh = .7
truth_thresh = 1
resize=1.5
new_coords=1
iou_normalizer=0.05
iou_loss=ciou

