[net]
batch=64
subdivisions=32
width=1280
height=960
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.000001
learning_rate_min=0.000001
burn_in=100

max_batches = 46250
policy=sgdr
sgdr_cycle=1000
sgdr_mult=2

gaussian_noise=1
flip=1


# 0
[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=relu

# 1
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 8
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=relu


[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 16
[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 24
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 32
[convolutional]
sparse=1
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=relu


##################################

### ASPPCSP ###
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -2

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

### ASPP ###
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=3
activation=relu

[route]
layers=-4

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
dilation=5
activation=relu

[route]
layers=-1,-3,-5,-6
### End SPP ###

[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

[route]
layers = -10,-1

# 44
[convolutional]
sparse=1
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu
### End SPPCSP ###

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2

[route]
layers = 30

[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7


# 56
[convolutional]
sparse=1
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#160x160

[route]
layers = 20

[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[route]
layers = -1,-3

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[route]
layers=-2

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[route]
layers = -1,-3,-5,-7

# 68
[convolutional]
sparse=1
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=relu

[upsample]
stride=2
#160x160

[route]
layers = 10,-1

[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu

[convolutional]
sparse=1
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=relu

# 68
[convolutional]
sparse=1
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=relu


[convolutional]
size=1
stride=1
pad=1
filters=9
activation=linear

[softmax]
groups=76800
stride=76800
#BGR
num=9
colormap=0,0,0, 86,94,219, 219,111,86, 86,219,145, 127,219,86, 219,211,86, 86,194,219, 219,86,160, 178,86,219

